# import numpy as np

# a = np.arange(10).reshape(2, 5)
# for x in a:
#     print(x) #(0 1 2 3 4) (5 6 7 8 9)

# print(a[0, 3]) #одно и тоже!
# print(a[0][3])

# print(a)
# print(a[:, 1]) #(1 6), второй столбец
# print(a[:, 3][1]) #8

# for row in a:
#     for val in row:
#         print(val, end=' ')
#     print()


# a = np.arange(10)
# b = a[[0, 0, 6, 3, 2]] #это просто копия, не представление
# b[0] = 10
# print(a, b) #массив a неизменяется
# #но если мы делаем наоборот, то тогда все меняется!
# a[[0, 0, 6, 3, 2]] = [10, 20, 30, 40, 50]
# print(a)

# idx = [0, 0, 1, 1, 1, 2]
# print(a[idx]) #сформирована копия [[]]!

# bidx = [True, True, False, True, True, True, False, True, True, True]
# print(a[bidx]) #только где true будут забраны элементы [0 1 3 4 5 7 8 9], размеры списков должны совпадать

# print(a[a >= 5]) #[5, 6, 7, 8, 9]


# a = np.arange(1, 8)
# i = np.array([[0, 1], [2, 3]])
# print(a[i]) #[1, 2], [3, 4]
#индексы те, что в массиве a, а форма, такая же, что и в массиве i
#реализовывать только через массив numpy, i != [[1, 2], [3, 4]]!!!


# a = np.arange(1, 13).reshape(3, 4)
# i0 = [0, 1]
# i1 = [1, 2]
# print(a[[0, 1],[1, 2]]) #[2 7]
# print(a[i0, i1])
# print(a[:, i1]) #[2, 3] [6, 7] [10, 11]


# a = np.arange(7)
# a[[0, 1, 2, -1]] = [10, 20, 30, 40]
# print(a) #[10, 20, 30, 3, 4, 5, 40]


# a[[0, 0, 0, 1]] = [1, 2, 3, 4]
# print(a[0]) #3 последнее это и есть индекс 0
# print(a)
# a[[0, 0]] = a[[0, 0]] + 1000 #то же самое, что и a[0] += 3
# print(a) #[1003, 4, 2, 3, 4, 5, 6]

# a[[0, 3, 4]] *= 100
# print(a) #вместо [0, 1, 2, 3, 4, 5, 6] стало [0, 1, 2, 300, 400, 5, 6]
